HUMAN_DESCRIPTION = """В большинстве миров люди — это самая молодая из распространённых рас. \
Они поздно вышли на мировую сцену и живут намного меньше, чем дварфы, эльфы и драконы. \
Возможно, именно краткость их жизней заставляет их стремиться достигнуть как можно большего в отведённый им срок. \
А быть может, они хотят что-то доказать старшим расам, и поэтому создают могучие империи, основанные на завоеваниях и торговле. \
Что бы ни двигало ими, люди всегда были инноваторами и пионерами во всех мирах."""

HALF_ORC_DESCRIPTION = """Полуорки наиболее часто живут среди орков. Среди других рас люди \
наиболее терпимо принимают полуорков, поэтому полуорки, которые не живут среди орков, чаще всего живут среди людей. \
Заслуживая ли признание среди жестоких варварских племен, или борясь за выживание в трущобах крупных городов, \
полуорки достигают всего своей физической мощью, выносливостью и решительностью, унаследованной от человеческих предков."""

ELF_DESCRIPTION = """Эльфы это волшебный народ, обладающий неземным изяществом, живущий в мире, но не являющийся его частью. \
Они живут в местах, наполненных воздушной красотой, в глубинах древних лесов или в серебряных жилищах, \
увенчанных сверкающими шпилями и переливающихся волшебным светом. \
Там лёгкие дуновения ветра разносят обрывки тихих мелодий и нежные ароматы. \
Эльфы любят природу и магию, музыку и поэзию, и всё прекрасное, что есть в мире."""