HUMAN_DESCRIPTION = """В большинстве миров люди — это самая молодая из распространённых рас. \
Они поздно вышли на мировую сцену и живут намного меньше, чем дварфы, эльфы и драконы. \
Возможно, именно краткость их жизней заставляет их стремиться достигнуть как можно большего в отведённый им срок. \
А быть может, они хотят что-то доказать старшим расам, и поэтому создают могучие империи, основанные на завоеваниях и торговле. \
Что бы ни двигало ими, люди всегда были инноваторами и пионерами во всех мирах."""

HUMAN_SPECIFICITY = """\nУвеличение характеристик: Значение всех ваших характеристик увеличивается на 1.
Альтернативный вариант:
Увеличение характеристик: Значение двух характеристик на ваш выбор увеличивается на 1.
Навыки: Вы получаете владение одним навыком на ваш выбор.
Черта: Вы получаете одну черту на ваш выбор.
Языки: Вы можете говорить, читать и писать на Общем и ещё одном языке на ваш выбор."""

HALF_ORC_DESCRIPTION = """Полуорки наиболее часто живут среди орков. Среди других рас люди \
наиболее терпимо принимают полуорков, поэтому полуорки, которые не живут среди орков, чаще всего живут среди людей. \
Заслуживая ли признание среди жестоких варварских племен, или борясь за выживание в трущобах крупных городов, \
полуорки достигают всего своей физической мощью, выносливостью и решительностью, унаследованной от человеческих предков."""

HALF_ORC_SPECIFICITY ="""\nУвеличение характеристик: Значение Силы +2, а значение Телосложения +1.
Тёмное зрение: на расстоянии в 60 футов вы при тусклом освещении можете видеть так, 
как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. 
В темноте вы не можете различать цвета, только оттенки серого.

Угрожающий вид: Вы владеете навыком Запугивание.

Непоколебимая стойкость: Если ваши хиты опустились до нуля, но вы при этом не убиты, 
ваши хиты вместо этого опускаются до 1. Вы не можете использовать эту способность снова, 
пока не завершите длительный отдых.

Свирепые атаки: Если вы совершили критическое попадание рукопашной атакой оружием, 
вы можете добавить к урону ещё одну кость урона оружия.

Языки: Вы можете говорить, читать и писать на Общем и Орочьем языках."""


ELF_DESCRIPTION = """Эльфы это волшебный народ, обладающий неземным изяществом, живущий в мире, но не являющийся его частью. \
Они живут в местах, наполненных воздушной красотой, в глубинах древних лесов или в серебряных жилищах, \
увенчанных сверкающими шпилями и переливающихся волшебным светом. \
Там лёгкие дуновения ветра разносят обрывки тихих мелодий и нежные ароматы. \
Эльфы любят природу и магию, музыку и поэзию, и всё прекрасное, что есть в мире."""

ELF_SPECIFICITY = """\nУвеличение характеристик: 
Значение вашей Ловкости увеличивается на 2. Значение вашего Интеллекта увеличивается на 1.

Тёмное зрение: на расстоянии в 60 футов вы при тусклом освещении можете видеть так, 
как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. 
В темноте вы не можете различать цвета, только оттенки серого.

Обострённые чувства: Вы владеете навыком Внимательность.

Наследие фей: Вы совершаете с преимуществом спасброски от очарования, и вас невоз можно магически усыпить.

Транс: Эльфы не спят. Вместо этого они погружаются в глубокую медитацию, находясь 
в полубессознательном состоянии до 4 часов в сутки. После такого отдыха вы получаете все
преимущества, которые получает человек после 8 часов сна.

Языки: Вы можете говорить, читать и писать на Общем и Эльфийском языках. 

Вы Высший Эльф:
Владение эльфийским оружием: Вы владеете длинным мечом, коротким мечом, коротким и длинным луками.

Заговор: Вы знаете один заговор из списка заклинаний волшебника. 
Базовой характеристикой для его использования является Интеллект.

Дополнительный язык: Вы можете говорить, читать и писать на ещё одном языке, на ваш выбор.
"""