"""Главное меню приложения.

Следует чистой архитектуре с правильными зависимостями.
"""

from src.ui.user_choice import get_user_choice
from src.di_container import get_character_creator


def show_main_menu() -> None:
    """Показать главное меню."""
    while True:
        choice = get_user_choice(
            [
                "🎭 Создать персонажа",
                "📋 Показать всех персонажей",
                "❌ Выход"
            ],
            "🏰 ГЛАВНОЕ МЕНЮ D&D MUD",
            allow_cancel=False
        )
        
        if choice == 1:
            # Создать персонажа
            character_creator = get_character_creator()
            character = character_creator.create_character()
            
            if character:
                input("\nНажмите Enter для продолжения...")
        
        elif choice == 2:
            # Показать всех персонажей (заглушка)
            print("\n📋 СПИСОК ПЕРСОНАЖЕЙ")
            print("="*40)
            print("Функция просмотра персонажей в разработке...")
            input("\nНажмите Enter для продолжения...")
        
        elif choice == 3:
            # Выход
            print("\n👋 Спасибо за использование D&D MUD!")
            break